Repository: zyuiop/gloveguide
Catalog: frontend/src/locale/messages.*.xlf
Languages: fr

# ngb.alert.close
source: Close
fr: Fermer

# ngb.carousel.previous
source: Previous
fr: Précédent

# ngb.carousel.next
source: Next
fr: Suivant

# ngb.datepicker.previous-month
source: Previous month
fr: Mois précédent

# ngb.datepicker.next-month
source: Next month
fr: Mois suivant

# ngb.datepicker.select-month
source: Select month
fr: Choisir un mois

# ngb.datepicker.select-year
source: Select year
fr: Choisir une année

# ngb.pagination.first-aria
source: First
fr: Premier

# ngb.pagination.previous-aria
source: Previous
fr: Précédent

# ngb.pagination.next-aria
source: Next
fr: Suivant

# ngb.pagination.last-aria
source: Last
fr: Dernier

# ngb.timepicker.increment-hours
source: Increment hours
fr: Incrémenter heures

# ngb.timepicker.hours
source: Hours
fr: Heures

# ngb.timepicker.decrement-hours
source: Decrement hours
fr: Décrémenter heures

# ngb.timepicker.increment-minutes
source: Increment minutes
fr: Incrémenter minutes

# ngb.timepicker.decrement-minutes
source: Decrement minutes
fr: Décrémenter minutes

# ngb.timepicker.increment-seconds
source: Increment seconds
fr: Incrémenter secondes

# ngb.timepicker.seconds
source: Seconds
fr: Secondes

# ngb.timepicker.decrement-seconds
source: Decrement seconds
fr: Décrémenter secondes

# ngb.toast.close-aria
source: Close
fr: Fermer

source: Disclaimer
fr: Mise en garde

source: This tool aggregates data from multiple sources to help you make the best decision when choosing which gloves to while handling chemicals. As with any computer program, it may have bugs or contain incorrect data. We will assume no liability for any damage this tool may indirectly cause.
fr: Cet outil aggrège des données depuis des sources multiples pour vous aider à prendre la meilleure décision lors du choix des gants à utiliser pour manipuler des produits chimiques. Comme tout programme informatique, ce guide peut contenir des bugs ou des données incorrectes. Nous ne prendrons aucune responsabilité pour tout dégât que cet outil pourrait indirectement causer.

source: This site uses some data from INRS' <a>ProtecPo</a>. This web software comes with its own disclaimer, reproduced here:
fr: Ce site utilise des données de l'outil <a>ProtecPo</a> de l'INRS qui dispose de sa propre mise en garde, reproduite ici :

source: <b>ProtecPo Disclaimer:</b> ProtecPo is a tool helping users to select polymer materials for skin protection when working with substances. ProtecPo's selection algorithm is based on robust modelling of the interactions between substances and polymers, it has been enriched and validated by the addition of physico-chemical and empirical data from several sources. <b>Nevertheless, it remains possible that the algorithm may make a selection error.</b> ProtecPo's recommendations should be considered as a first step in the selection of polymers, helping to orient your choice towards appropriate skin protection. However, they are in no way a substitute for experience with or performance tests of your protective materials. ProtecPo does not take the actual conditions where substances and protective materials are used into account.
fr: <b>Mise en garde ProtecPo :</b> ProtecPo est un outil d’aide au choix de la sélection de vos matériaux polymères de protection cutanée aux substances. Les résultats ont un caractère prédictif. Ils sont basés sur une modélisation des interactions entre substances chimiques et matériau polymère établie à partir de la théorie tridimensionnelle de solubilité. L’algorithme de sélection de ProtecPo est robuste, enrichi et validé par de nombreuses données physico-chimiques et empiriques. <b>Toutefois, une erreur de sélection par l’algorithme du logiciel reste possible.</b> Les recommandations de ProtecPo sont à considérer comme une première sélection de matériaux polymères pour vous orienter vers des protections cutanées résistantes aux substances chimiques. ProtecPo ne prend pas en compte les conditions réelles d’utilisation des produits et des protections, et les conséquences de leur contact avec la peau (exemple : allergie aux protéines du latex ou additifs dans les polymères). Ainsi, les recommandations de ProtecPo ne se substituent en aucun cas aux tests de performance de vos matériaux de protection et à l’avis des professionnels de santé et de sécurité.

source: <b>In all cases, you should change your protection immediately upon contact with a chemical product, in particular when fine disposable protections are used.</b>
fr: <b>Votre protection doit être changée immédiatement et impérativement dès qu’un contact avec un produit chimique a eu lieu, en particulier lors d’utilisation de fines protections jetables.</b>

source: Take me out of here
fr: Sortez moi de là

source: I understand the risks
fr: Je comprends les risques

source: EPFL Gloves Guide
fr: Guide des gants EPFL

source: Search for a {this.allowGloves, select, true {...} false {...}}...
fr: Rechercher {this.allowGloves, select, true {...} false {...}}...

source: {VAR_SELECT_1, select, true {{VAR_SELECT, select, true {substance or glove } false {glove } } } false {substance } }
fr: {VAR_SELECT_1, select, true {{VAR_SELECT, select, true {une substance ou un gant } false {un gant } } } false {une substance } }

source: Search in progress...
fr: Recherche en cours...

source: Please wait while we search for substances...
fr: Merci de patienter pendant la recherche de substances...

source: Search results
fr: Résultats de recherche

source: <b>No results found.</b> Try searching with a different query.
fr: <b>Aucun résultat trouvé.</b> Essayez d'utiliser d'autres mots clé (attention : la base de substances est en anglais uniquement).

source: Compose a solution
fr: Protection contre les mélanges

source: Permeation time in minutes (duration for a chemical to get through the glove; <b>Never use the glove longer than the permeation time</b>)
fr: Temps de perméation en minutes (temps que met le chimique/mélange à traverser le gant ; <b>le temps d’utilisation du gant ne doit jamais dépasser le temps de perméation</b>)

source: This page allows you to quickly search for the best gloves given a solution. Alternatively, you can also use the main search bar and the button "Add to solution".
fr: Cette section vous permet de rapidement trouver les gants recommandés pour votre mélange de substances. Alternativement, vous pouvez aussi utiliser la barre de recherche principale et le bouton "Ajouter au mélange".

source: Solution
fr: Composition du mélange

source: Reset solution
fr: Réinitialiser le mélange

source: Best gloves results for this solution
fr: Recommendations de gants pour ce mélange

source: <b> <mat-icon>error</mat-icon> Calculation impossible:</b> the sum of the proportions of each substance doesn't make up to 100%.
fr: <b><mat-icon>error</mat-icon> Calcul impossible :</b> la somme des proportions de chaque substance ne fait pas 100%.

source: <i>Add substances to search for gloves</i>
fr: <i>Ajoutez des substances pour rechercher des gants.</i>

source: List of all gloves
fr: Liste de tous les gants

source: <i>Click on any glove to see its specifications and a list of tested chemicals.</i>
fr: <i>Cliquez sur un gant pour voir ses spécifications et une liste de produits chimiques testés.</i>

source: <b>The rating provided here is a general rating.</b> It is not specific to a chemical and doesn't indicate whether a particular glove will resist well to a particular chemical.
fr: <b>La notation indiquée ici est une note générale basée sur la résistance chimique et la prise en main d'objets.</b> Elle n'est pas spécifique à un produit chimique et n'indique pas si le gant va bien résister ou non à un produit chimique donné. Cliquez sur un gant pour en savoir plus sur sa notation et obtenir des recommendations.

source: Reusable Glove
fr: Gant réutilisable

source: <mat-icon>error</mat-icon> <b>No glove found:</b> There is no glove in the database with these types. Please see the <a>list of all gloves</a> for alternative options.
fr: <mat-icon>error</mat-icon> <ng-container> <b>No glove found:</b> Actuellement, cette base de données ne permet pas une recommandation de gants jetables (fins) pour ce type de mélange. Merci de considérer les gants réutilisables (épais) à disposition dans votre magasin à l’EPFL. </ng-container> <ng-container> <b>Aucun gant trouvé :</b> Il n'y a aucun gant de ce type dans la base de données. Merci de chercher dans la <a>liste de tous les gants</a> pour trouver une alternative. </ng-container>

source: Good
fr: Bon

source: Medium
fr: Moyen

source: Fair
fr: Acceptable

source: Poor
fr: Mauvais

source: Glove
fr: Gant

source: <b>Sorry!</b> No resistance data was found for this glove or substance.
fr: <b>Désolé !</b> Aucune donnée trouvée pour ce gant ou cette substance.

source: <b>Tip:</b> search for <code>glove:</code> to list gloves & search only in gloves.
fr: <b>Astuce :</b> cherchez <code>glove:</code> pour lister les gants

source: Selected glove <b>{{selectedGlove.brand}} {{selectedGlove.name}}</b> (Ref {{selectedGlove.reference}})
fr: Gant sélectionné : <b>{{selectedGlove.brand}}{{selectedGlove.name}}</b> (Ref {{selectedGlove.reference}}) <button>Modifier ce gant</button> <button>Supprimer ce gant</button>

source: Ranked #{{selectedGlove.ranking}} - <app-rating-badge></app-rating-badge>
fr: Classé #{{selectedGlove.ranking.ranking}} - <app-rating-badge></app-rating-badge>

source: Ranking among all disposable gloves offered on the system, based on chemical resistance and objects handling - 1 being the best glove.
fr: Classement parmi tous les gants réutilisables proposés sur le service, basé sur la résistance aux chimiques et la prise en main d'objets.

source: Non disposable glove <app-rating-badge></app-rating-badge>
fr: Gant réutilisable <app-rating-badge></app-rating-badge>

source: whatever
fr: Seuls les gants à usage unique ont été notés sur ce service. Merci de contacter votre inventaire pour obtenir ce gant.

source: Specifications
fr: Spécifications

source: <li>Reference: <code>{{selectedGlove.reference}}</code></li> <li>Material: {{selectedGlove.materials.join(", ")}}</li> <li>Length: {{selectedGlove.specifications.length}}mm</li> <li>This glove is disposable.</li> <li>Palm thickness: {{selectedGlove.specifications.thickness ? selectedGlove.specifications.thickness : 'N/A'}}mm </li> <li>Finger textured: {selectedGlove.specifications.fingerTextured, select, true {...} false {...}}</li> <li> Powdered: {selectedGlove.specifications.powdered, select, true {...} false {...}}</li> <li>Vulcanization agent(s): {!selectedGlove.specifications.vulcanizationAgent, select, true {...} other {...}} </li> <li><a>EN ISO 374-1</a>: <ul> <li>Type {{selectedGlove.specifications.standardType}}</li> <li>Resistance {{selectedGlove.specifications.standardResistance}}</li> <li>AQL {{selectedGlove.specifications.aql ? selectedGlove.specifications.aql : 'N/A'}}</li> </ul> </li>
fr: <li>Référence: <code>{{selectedGlove.reference}}</code></li> <li>Matière: {{selectedGlove.materials.join(", ")}}</li> <li>Longueur: {{selectedGlove.specifications.length}}mm</li> <li>Ce gant est un gant jetable.</li> <li>Épaisseur paume : {{selectedGlove.specifications.thickness ? selectedGlove.specifications.thickness : 'N/A'}}mm </li> <li>Texturé au doigt : {selectedGlove.specifications.fingerTextured, select, true {...} false {...}}</li> <li>Poudré : {selectedGlove.specifications.powdered, select, true {...} false {...}}</li> <li>Agent(s) de vulcanisation : {!selectedGlove.specifications.vulcanizationAgent, select, true {...} other {...}} </li> <li><a>EN ISO 374-1</a> : <ul> <li>Type {{selectedGlove.specifications.standardType}}</li> <li>Résistance {{selectedGlove.specifications.standardResistance}}</li> <li>AQL {{selectedGlove.specifications.aql ? selectedGlove.specifications.aql : 'N/A'}}</li> </ul> </li>

source: {VAR_SELECT, select, true {Yes} false {No} }
fr: {VAR_SELECT, select, true {Oui} false {Non} }

source: {VAR_SELECT, select, true {Yes} false {No} }
fr: {VAR_SELECT, select, true {Oui} false {Non} }

source: {VAR_SELECT, select, true {Unknown} other {{{selectedGlove.specifications.vulcanizationAgent}} } }
fr: {VAR_SELECT, select, true {Inconnu(s)} other {{{selectedGlove.specifications.vulcanizationAgent}} } }

source: Ratings
fr: Notation

source: <li>Ease to wear: <app-rating-badge></app-rating-badge> </li> <li>Ease to remove: <app-rating-badge></app-rating-badge> </li> <li>Glass handling: <ul> <li>{{pair.humidifier}}: <app-rating-badge></app-rating-badge> {pair.leavesMarks, select, true {...}} </li> </ul> </li> <li>Traction resistance: <ul> <li>{{pair.humidifier}}: <app-rating-badge></app-rating-badge> </li> </ul> </li>
fr: <li>Facilité à enfiler : <app-rating-badge></app-rating-badge></li><li>Faciliter à retirer : <app-rating-badge></app-rating-badge></li><li>Prise en main de verrerie : <ul><li>{{pair.humidifier}}: <app-rating-badge></app-rating-badge>{pair.leavesMarks, select, true {...}}</li></ul></li><li>Résistance à la traction : <ul><li>{{pair.humidifier}}: <app-rating-badge></app-rating-badge></li></ul></li>

source: {VAR_SELECT, select, true {(leaves marks))} }
fr: {VAR_SELECT, select, true {(laisse des marques))} }

source: Substances compatibility
fr: Résistance contre les substances

source: © 2020 - Louis Vialar & contributors for EPFL / ISIC-GSCP<br/>This application is a free software, published under the GNU AGPL v3 license.<br/>Source code available on GitHub <a>zyuiop/gloveguide</a>.
fr: © 2020 - Louis Vialar & contributeurs pour le ISIC-GSCP / EPFL<br/>Cette application est un logiciel libre publié sous licence GNU AGPL v3.<br/>Vous pouvez obtenir une copie du code source sur GitHub <a>zyuiop/gloveguide</a>.

source: Substances resistance
fr: Résistance aux substances

source: According to internal tests or spec sheets.
fr: D'après des tests internes ou les feuilles de spécifications du fabricant.

source: Solution composition
fr: Composition du mélange

source: Close
fr: Fermer

source: See results
fr: Voir les résultats

source: Selected substance <b>{{selectedSubstance.name}}</b> (CAS {{selectedSubstance.casNumber}}) <button>Add to solution</button>
fr: Substance choisie <b>{{selectedSubstance.name}}</b> (CAS {{selectedSubstance.casNumber}}) <button>Ajouter au mélange</button>

source: Welcome on EPFL Gloves Guide!
fr: Bienvenue sur le guide des gants EPFL ! Utilisez la barre de recherche ci dessus pour trouver des substances ou gants. Si vous avez besoin de protection contre un mélange de substances, vous pouvez utiliser le formulaire <i>Protection contre les mélanges</i> suivant.

source: <b>How to remove gloves?</b> Here is an helpful video that demonstrates how to remove contaminated gloves safely: <a>How to remove gloves?</a>
fr: <b>Comment retirer des gants ?</b> Voici une vidéo utile qui montre comment retirer des gants contaminés facilement (en anglais) : <a>Comment retirer des gants ?</a>

source: <b>All gloves.</b> You can find here a list of all the gloves we offer: <a>All gloves</a>
fr: <b>Tous les gants.</b> Vous trouverez ici une liste de tous les gants que nous proposons : <a>Tous les gants</a>

source: Insert substances
fr: Insérer des substances

source: The following results are provided by INRS's <a>ProtecPo</a>.
fr: Les résultats suivants sont fournis par le service <a>ProtecPo</a> de l'INRS.

source: <mat-icon>error</mat-icon> No recommendation can be made because of a too high uncertainty in the composition.
fr: <mat-icon>error</mat-icon> Aucune recommendation ne peut être faite en raison d'une trop grande incertitude dans la composition.

source: <mat-icon>warning</mat-icon> The relevance of the recommendation below may be affected by the uncertainty with regard to the composition. Thick protections should be favoured. Multi-layer laminated materials, made up of co-polymers, also exist.
fr: <mat-icon>warning</mat-icon> Attention : la pertinence de la recommandation ci-dessous est affectée compte tenu de l'incertitude sur la composition de substances organiques. Privilégiez une protection épaisse. Il existe également des matériaux laminés multicouches de co-polymères.

source: <mat-icon>error</mat-icon> No result could be recommended by ProtecPo for this solution.
fr: <mat-icon>error</mat-icon> Aucun gant ne peut être recommandé par ProtecPo pour ce mélange.

source: {{glove.material}} gloves provide <app-rating-badge></app-rating-badge> resistance.
fr: Les gants en {{glove.material}} ont une résistance notée : <app-rating-badge></app-rating-badge>

source: Here are the corresponding gloves in our database:
fr: Voici les gants correspondants dans notre base de données :

source: {{s.substance.name}} (CAS number: {{s.substance.casNumber}})
fr: {{s.substance.name}} (N° CAS : {{s.substance.casNumber}})

source: Water or aqueous solution
fr: Eau ou solution aqueuse

source: Impurities or unknown substances
fr: Impuretés ou substances inconnues
